dgarcoe/ham_radio_companion_sensecap_indicator/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash & PSRAM (SenseCAP Indicator D1L: 8 MB flash, 8 MB Octal PSRAM)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Custom partition table (factory + 2 ota + nvs + storage)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS tick
CONFIG_FREERTOS_HZ=1000

# LWIP
CONFIG_LWIP_LOCAL_HOSTNAME="hamcompanion"

# mbedTLS cert bundle (used by esp_http_client over HTTPS for the
# propagation fetcher and any future TLS endpoints).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# SenseCAP Indicator D1L panel selection (BSP)
CONFIG_LCD_BOARD_SENSECAP_INDICATOR_D1L=y
CONFIG_SENSECAP_INDICATOR_SCREEN_GX=y

# LVGL: use PSRAM for buffers
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEM_SIZE_KILOBYTES=48
CONFIG_LV_COLOR_DEPTH_16=y

# LVGL fonts used by the UI (watch + status bar + settings)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y
